import numpy as np
import cv2

img = np.zeros((512,512,3), np.float64)

# 좌표 0,0에서 좌표 512,512로 구성된 선분
# 색 blue-green-red 순서
# 선분의 색은 255,0,0로 파란색
# 굵기는 5pixel임
cv2.line(img, (0,0), (512,512), (255,0,0), 5)

# 좌상단 384, 0과 우하단 510,128인 직사각형
# 색은 0,255,0으로 초록색
# 굵기는 3pixel임
cv2.rectangle(img, (384,0), (510,128), (0,255,0), 3)

# 중심점 447,63이고 반지름 63인 원
# 색은 0,0,255로 빨간색
# 굵기는 -1로 도형을 채움형태로 그림
cv2.circle(img, (447,63), 63, (255,0,255), 1)

# 중심점이 256,256이고 가로 반지름과 세로 반지름이 100, 50이며
# 45도 시계방향으로 회전하고 시작각이 0도, 종료각이 180도인 타원
# 색은 0,0,255로 빨간색
# 굵기는 -1로 도형을 채움형태로 그림
cv2.ellipse(img, (256,256), (100,50), 45, 0, 180, (0,0,255), -1)

# 다각형
pts = np.array([[10,5], [20,30], [170,20], [50,10]], np.int32)
pts = pts.reshape((-1,1,2))
cv2.polylines(img, [pts], True, (0,255,255))

# 글씨쓰기
font =  cv2.FONT_HERSHEY_SIMPLEX
cv2.putText(img, 'OpenCV', (10,500), font, 4, (255,255,255), 2)

#cv2.line(img, (400, 401), (400, 401), (255,185, 203), 5)
#cv2.line(img, (400, 405), (400, 405), (255,185, 203), 5)
#cv2.line(img, (400, 410), (400, 410), (255,185, 203), 5)

cv2.line(img, (0.01, -0.08), (0.01, -0.08), (255,185, 203), 5)

cv2.imshow('img',img)
cv2.waitKey()
cv2.destroyAllWindows()
